# Essential Development Tools & CLI
brew "bash"
brew "git"
brew "gh"                 # GitHub CLI
brew "jq"                 # JSON processor
brew "ripgrep"            # Fast text search
brew "fd"                 # Fast find alternative
brew "tree-sitter"        # Parser generator tool
brew "stow"               # Symlink farm manager

# Terminal & Shell
brew "tmux"               # Terminal multiplexer
brew "zplug"              # Zsh plugin manager
brew "neovim"             # Modern Vim

# Language Management & Development
brew "mise"               # Runtime version manager (replaces rbenv, nvm, etc)
brew "node"               # JavaScript runtime

# Cloud & Infrastructure
brew "awscli"             # AWS CLI
brew "doctl"              # DigitalOcean CLI
brew "rclone"             # Cloud storage sync
brew "docker"             # Container platform
brew "docker-buildx"      # Docker build enhancements
brew "docker-completion"  # Docker completion
brew "colima"             # Container runtime for macOS
brew "lima"               # Linux VMs for macOS

# Database
brew "postgresql@14"      # PostgreSQL database

# VPN & Security
brew "openvpn"            # VPN client
brew "openfortivpn"       # Fortinet VPN client
brew "wireguard-go"       # WireGuard VPN
brew "wireguard-tools"    # WireGuard tools

# Git & Version Control
brew "lazygit"            # Git TUI

# System Libraries (automatically installed as dependencies)
brew "openssl@3"
brew "libgit2"
brew "libyaml"
brew "readline"
brew "sqlite"

# Applications (Casks)
cask "1password-cli"      # 1Password CLI
cask "alacritty"          # GPU-accelerated terminal
cask "google-cloud-sdk"   # Google Cloud SDK